Enums/ВидыРабочегоВремениСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыРабочегоВремениСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу полную рабочую смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеСверхНормы</Name>
					<Comment>Начисление за работу сверх нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦелодневноеНеотработанное</Name>
					<Comment>Неотработанные полные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеНеотработанное</Name>
					<Comment>Неотработанные неполные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноОплачиваемоеВПределахНормы</Name>
					<Comment>Дополнительное начисление в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу неполную смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыРабочегоВремениСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формирует массив видов рабочего времени, обозначающих время, затраченное за целый день.
Функция ЦелодневныеВидыРабочегоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЦелодневноеНеотработанное);
	
	Возврат ВидыВремени;
	
КонецФункции

// Формирует массив видов рабочего времени, обозначающих время, затраченное за неполную рабочую смену
// (внутрисменные отклонения или работу неполный рабочий день).
Функция НецелодневныеВидыРабочегоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеНеотработанное);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);
	
	Возврат ВидыВремени;
	
КонецФункции

// Формирует массив видов рабочего времени, обозначающих отработанное время.
Функция ВидыОтработанногоВремени() Экспорт
	
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеСверхНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы);
	
	Возврат ВидыВремени;
	
КонецФункции

// Возвращает способ учета времени, используемый в документах отклонений, в зависимости от параметра "Внутрисменное".
Функция ВидВремениДокументовОтклонений(ПризнакЧасовоеОтклонение) Экспорт
	Возврат ?(ПризнакЧасовоеОтклонение, ЧасовоеНеотработанное, ЦелодневноеНеотработанное);
КонецФункции

// Возвращает все способы учета времени, используемые в документах отклонений.
Функция ВидыВремениДокументовОтклонений() Экспорт
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(ВидВремениДокументовОтклонений(Ложь));
	ВидыВремени.Добавить(ВидВремениДокументовОтклонений(Истина));
	Возврат ВидыВремени;
КонецФункции

#КонецОбласти

#КонецЕсли
